src/cf/src/Documents/КассоваяСмена/КассоваяСмена.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КассоваяСмена</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаОткрытия</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаЗакрытия</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыКассовойСмены</types>
    </type>
  </attributes>
  <attributes>
    <name>Касса</name>
    <type>
      <types>CatalogRef.Кассы</types>
    </type>
  </attributes>
</mdclass:Document>

src/cf/src/AccumulationRegisters/ДвиженияПоКассе/ДвиженияПоКассе.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ДвиженияПоКассе</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <dimensions>
    <name>ДокументПродажи</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.НалоговаяНакладная</types>
      <types>DocumentRef.ПоступлениеТоваровУслуг</types>
      <types>DocumentRef.НалоговаяНакладнаяПокупка</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КассоваяСмена</name>
    <type>
      <types>DocumentRef.КассоваяСмена</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
      <types>CatalogRef.Кассы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипДвижения</name>
    <type>
      <types>EnumRef.ТипыДвиженияДенежныхСредств</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипДенежныхСредств</name>
    <type>
      <types>CatalogRef.TypesDePayment</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипНоменклатуры</name>
    <type>
      <types>EnumRef.ТипыНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/cf/src/AccumulationRegisters/Продажи/Продажи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Продажи</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>DefinedType.Количество</types>
    </type>
  </resources>
  <resources>
    <name>Себестоимость</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <resources>
    <name>ДополнительныеРасходы</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <resources>
    <name>Выручка</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <resources>
    <name>НДС</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <resources>
    <name>ВаловаяПрибыль</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <dimensions>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументПродажи</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>DefinedType.ПриходныйДокументПартии</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/cf/src/Enums/ТипыДвиженияДенежныхСредств/ТипыДвиженияДенежныхСредств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыДвиженияДенежныхСредств</name>
  <enumValues>
    <name>Поступление</name>
  </enumValues>
  <enumValues>
    <name>Списание</name>
  </enumValues>
</mdclass:Enum>

src/cf/src/Enums/ТипыНоменклатуры/ТипыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыНоменклатуры</name>
  <enumValues>
    <name>Товар</name>
  </enumValues>
  <enumValues>
    <name>Услуга</name>
  </enumValues>
  <enumValues>
    <name>Продукция</name>
  </enumValues>
  <enumValues>
    <name>Полуфабрикат</name>
  </enumValues>
  <enumValues>
    <name>Сырье</name>
  </enumValues>
</mdclass:Enum>

src/cf/src/Enums/ХозяйственныеОперации/ХозяйственныеОперации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ХозяйственныеОперации</name>
  <enumValues>
    <name>АвансКлиента</name>
  </enumValues>
  <enumValues>
    <name>ВозвратДенежныхСредствОтПоставщика</name>
  </enumValues>
  <enumValues>
    <name>ВозвратОплатыКлиенту</name>
  </enumValues>
  <enumValues>
    <name>ВозвратТоваровОтКлиента</name>
  </enumValues>
  <enumValues>
    <name>ВозвратТоваровПоставщику</name>
  </enumValues>
  <enumValues>
    <name>ВыдачаДенежныхСредствВКассу</name>
  </enumValues>
  <enumValues>
    <name>ВыплатаЗарплаты</name>
  </enumValues>
  <enumValues>
    <name>ЗакупкаУПоставщика</name>
  </enumValues>
  <enumValues>
    <name>КомплектацияНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>ОплатаПоставщику</name>
  </enumValues>
  <enumValues>
    <name>ПеремещениеОприходование</name>
  </enumValues>
  <enumValues>
    <name>ПеремещениеСписание</name>
  </enumValues>
  <enumValues>
    <name>ПеречислениеДенежныхСредствНаБанковскийСчет</name>
  </enumValues>
  <enumValues>
    <name>ПеречислениеНалоговИВзносов</name>
  </enumValues>
  <enumValues>
    <name>ПланируемыеЦеныЗакупки</name>
  </enumValues>
  <enumValues>
    <name>ПоступлениеДенежныхСредствИзКассы</name>
  </enumValues>
  <enumValues>
    <name>ПоступлениеДенежныхСредствСБанковскогоСчета</name>
  </enumValues>
  <enumValues>
    <name>ПоступлениеОплатыОтКлиента</name>
  </enumValues>
  <enumValues>
    <name>ПродажаВКредит</name>
  </enumValues>
  <enumValues>
    <name>ПрочееПоступлениеДенежныхСредств</name>
  </enumValues>
  <enumValues>
    <name>ПрочийРасходДенежныхСредств</name>
  </enumValues>
  <enumValues>
    <name>РазукомплектацияНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>РеализацияКлиенту</name>
  </enumValues>
  <enumValues>
    <name>Сертификат</name>
  </enumValues>
  <enumValues>
    <name>СнятиеНаличныхДенежныхСредств</name>
  </enumValues>
  <enumValues>
    <name>СписаниеЗадолженности</name>
  </enumValues>
  <enumValues>
    <name>УстановкаЦенНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>ОбналичиваниеЧека</name>
  </enumValues>
  <enumValues>
    <name>ОперационныеЗатраты</name>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
  </enumValues>
  <enumValues>
    <name>Инкассация</name>
  </enumValues>
</mdclass:Enum>

src/cf/src/Documents/КассоваяСмена/ManagerModule.bsl
Function ПечатьEtatZOld(Док, Spreadsheet) Export
	Template = Документы.КассоваяСмена.ПолучитьМакет("EtatZ");
	Query = New Query;
	Query.Text =
	"ВЫБРАТЬ
	|	ДвиженияПоКассеОбороты.Период КАК Date,
	|	ДвиженияПоКассеОбороты.Регистратор КАК Регистратор,
	|	ДвиженияПоКассеОбороты.ДокументПродажи КАК ДокументПродажи,
	|	ДвиженияПоКассеОбороты.КассоваяСмена КАК КассоваяСмена,
	|	ДвиженияПоКассеОбороты.МестоХранения КАК МестоХранения,
	|	ДвиженияПоКассеОбороты.Организация КАК Organisation,
	|	ДвиженияПоКассеОбороты.ТипДвижения КАК ТипДвижения,
	|	ДвиженияПоКассеОбороты.ТипДенежныхСредств КАК ТипДенежныхСредств,
	|	ДвиженияПоКассеОбороты.ТипНоменклатуры КАК ТипНоменклатуры,
	|	ДвиженияПоКассеОбороты.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	ВЫБОР
	|		КОГДА ДвиженияПоКассеОбороты.ТипДвижения = ЗНАЧЕНИЕ(Перечисление.ТипыДвиженияДенежныхСредств.Поступление)
	|			ТОГДА 1
	|		ИНАЧЕ -1
	|	КОНЕЦ * ДвиженияПоКассеОбороты.СуммаОборот КАК Сумма
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	РегистрНакопления.ДвиженияПоКассе.Обороты(
	|			,
	|			,
	|			Регистратор,
	|			КассоваяСмена = &КассоваяСмена
	|				И ТипДенежныхСредств = ЗНАЧЕНИЕ(Справочник.TypesDePayment.Cash)) КАК ДвиженияПоКассеОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ПродажиОбороты.ВыручкаОборот) КАК Сумма
	|ИЗ
	|	РегистрНакопления.Продажи.Обороты КАК ПродажиОбороты
	|ГДЕ
	|	ВЫБОР
	|			КОГДА ПродажиОбороты.ДокументПродажи.КассоваяСмена = ЗНАЧЕНИЕ(Документ.КассоваяСмена.ПустаяСсылка)
	|				ТОГДА НАЧАЛОПЕРИОДА(ПродажиОбороты.ДокументПродажи.Дата, ДЕНЬ) = НАЧАЛОПЕРИОДА(&ДатаКассовойСмены, ДЕНЬ)
	|						И ПродажиОбороты.ДокументПродажи.МестоХранения = &МестоХранения
	|			ИНАЧЕ ПродажиОбороты.ДокументПродажи.КассоваяСмена = &КассоваяСмена
	|		КОНЕЦ
	|	И ПродажиОбороты.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ПродажиОбороты.ВыручкаОборот) КАК Сумма
	|ИЗ
	|	РегистрНакопления.Продажи.Обороты КАК ПродажиОбороты
	|ГДЕ
	|	ВЫБОР
	|			КОГДА ПродажиОбороты.ДокументПродажи.КассоваяСмена = ЗНАЧЕНИЕ(Документ.КассоваяСмена.ПустаяСсылка)
	|				ТОГДА НАЧАЛОПЕРИОДА(ПродажиОбороты.ДокументПродажи.Дата, ДЕНЬ) = НАЧАЛОПЕРИОДА(&ДатаКассовойСмены, ДЕНЬ)
	|						И ПродажиОбороты.ДокументПродажи.МестоХранения = &МестоХранения
	|			ИНАЧЕ ПродажиОбороты.ДокументПродажи.КассоваяСмена = &КассоваяСмена
	|		КОНЕЦ
	|	И ПродажиОбороты.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ВТ.Сумма) КАК Сумма
	|ИЗ
	|	ВТ КАК ВТ
	|ГДЕ
	|	ВТ.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияКлиенту)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	СУММА(ВТ.Сумма) КАК Сумма
	|ИЗ
	|	ВТ КАК ВТ
	|ГДЕ
	|	ВТ.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПродажаВКредит)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ.ХозяйственнаяОперация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	СУММА(ВТ.Сумма) КАК Сумма
	|ИЗ
	|	ВТ КАК ВТ
	|ГДЕ
	|	НЕ ВТ.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияКлиенту), ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПродажаВКредит))
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ.ХозяйственнаяОперация";
	Query.Parameters.Insert("КассоваяСмена", Док);
	Query.Parameters.Insert("МестоХранения", Док.МестоХранения);
	Query.Parameters.Insert("ДатаКассовойСмены", Док.Дата);
	ТЗ = Query.ВыполнитьПакет();
	
	Header = Template.GetArea("Шапка");
	AreaTabularSection = Template.GetArea("Строка");
	AreaTabularSectionFooterTotal = Template.GetArea("Подвал"); 
	
	Header.Parameters.Fill(Док);
	
	FieldPhoto = Док.Организация.Логотип.Get();
	Try
		Header.Drawings[0].Picture = New Picture(FieldPhoto);
	Except
	EndTry;
	
	Spreadsheet.Put(Header);
	
	TotalSomme = 0;
	TotalSommeCA = 0;
	
	//Ventes produits
	ТЗРаздел = ТЗ.Получить(1).Выгрузить();
	AreaTabularSection.Параметры.Operation = "Ventes Produits";
	СуммаТовары = ?(ТЗРаздел.Количество() = 0, 0, ?(ЗначениеЗаполнено(ТЗРаздел.Получить(0).Сумма),ТЗРаздел.Получить(0).Сумма,0));
	AreaTabularSection.Параметры.Somme = СуммаТовары;
	Spreadsheet.Put(AreaTabularSection);
	TotalSommeCA = TotalSommeCA + СуммаТовары;
	
	//Ventes service
	ТЗРаздел = ТЗ.Получить(2).Выгрузить();
	AreaTabularSection.Параметры.Operation = "Ventes Services";
	СуммаУслуг = ?(ТЗРаздел.Количество() = 0, 0, ?(ЗначениеЗаполнено(ТЗРаздел.Получить(0).Сумма),ТЗРаздел.Получить(0).Сумма,0));
	AreaTabularSection.Параметры.Somme = СуммаУслуг;
	Spreadsheet.Put(AreaTabularSection);
	TotalSommeCA = TotalSommeCA + СуммаУслуг;
	
	//Ventes et Avoirs Encaissées
	ТЗРаздел = ТЗ.Получить(3).Выгрузить();
	AreaTabularSection.Параметры.Operation = "Ventes et Avoirs Encaissées";
	СуммаТовары = ?(ТЗРаздел.Количество() = 0, 0, ?(ЗначениеЗаполнено(ТЗРаздел.Получить(0).Сумма),ТЗРаздел.Получить(0).Сумма,0));
	AreaTabularSection.Параметры.Somme = СуммаТовары;
	Spreadsheet.Put(AreaTabularSection);
	TotalSomme = TotalSomme + СуммаТовары;

	//Credits Encaissées
	ТЗРаздел = ТЗ.Получить(4).Выгрузить();
	AreaTabularSection.Параметры.Operation = "Credits Encaissées";
	СуммаТовары = ?(ТЗРаздел.Количество() = 0, 0, ?(ЗначениеЗаполнено(ТЗРаздел.Получить(0).Сумма),ТЗРаздел.Получить(0).Сумма,0));
	AreaTabularSection.Параметры.Somme = СуммаТовары;
	Spreadsheet.Put(AreaTabularSection);
	TotalSomme = TotalSomme + СуммаТовары;
	
	ТЗРаздел = ТЗ.Получить(5).Выгрузить();
	Для Каждого Стр из ТЗРаздел Цикл 
		AreaTabularSection.Параметры.Operation = Стр.ХозяйственнаяОперация;
		AreaTabularSection.Параметры.Somme = Стр.Сумма;
		TotalSomme = TotalSomme + Стр.Сумма;
		Spreadsheet.Put(AreaTabularSection);
	КонецЦикла;
	
	Solde = ?(Док.Статус = Перечисления.СтатусыКассовойСмены.Закрыта, Док.СуммаЗакрытия, РаботаСДокументами.ПолучитьОстатокВКассе(Док.Касса));
	AreaTabularSectionFooterTotal.Parameters.Total = ""+Format(TotalSomme,"ЧДЦ=2; ЧРГ=' '; ЧН=0,00");
	AreaTabularSectionFooterTotal.Parameters.TotalCA = ""+Format(TotalSommeCA,"ЧДЦ=2; ЧРГ=' '; ЧН=0,00");
	AreaTabularSectionFooterTotal.Parameters.Solde = ""+Format(Solde,"ЧДЦ=2; ЧРГ=' '; ЧН=0,00");
	//AreaTabularSectionFooterTotal.Parameters.TotalSommePaiement =  ""+Format(TotalSommePaiement,"ЧДЦ=2; ЧРГ=' '; ЧН=0,00");
	//AreaTabularSectionFooterTotal.Parameters.ОстатокОплаты =  ""+Format(Selection.TotalSomme - TotalSommePaiement,"ЧДЦ=2; ЧРГ=' '; ЧН=0,00");
	AreaTabularSectionFooterTotal.Parameters.Дата = ТекущаяДатаСеанса();
	
	Spreadsheet.Put(AreaTabularSectionFooterTotal);
	Spreadsheet.PutHorizontalPageBreak();
	
	Return Spreadsheet;
	
	//}}
EndFunction

Function ПечатьEtatZ(Док, Spreadsheet) Export
	Template = Документы.КассоваяСмена.ПолучитьМакет("EtatZ");
	Query = New Query;
	Query.Text =
	"ВЫБРАТЬ
	|	ДвиженияПоКассеОбороты.ТипДенежныхСредств КАК ТипДенежныхСредств,
	|	СУММА(ВЫБОР
	|			КОГДА ДвиженияПоКассеОбороты.ТипДвижения = ЗНАЧЕНИЕ(Перечисление.ТипыДвиженияДенежныхСредств.Поступление)
	|				ТОГДА 1
	|			ИНАЧЕ -1
	|		КОНЕЦ * ДвиженияПоКассеОбороты.СуммаОборот) КАК Сумма
	|ИЗ
	|	РегистрНакопления.ДвиженияПоКассе.Обороты(, , Регистратор, КассоваяСмена = &КассоваяСмена) КАК ДвиженияПоКассеОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	ДвиженияПоКассеОбороты.ТипДенежныхСредств
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТипДенежныхСредств
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДвиженияПоКассеОбороты.КассоваяСмена КАК КассоваяСмена,
	|	ДвиженияПоКассеОбороты.ТипДвижения КАК ТипДвижения,
	|	ДвиженияПоКассеОбороты.ТипДенежныхСредств КАК ТипДенежныхСредств,
	|	ДвиженияПоКассеОбороты.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	СУММА(ВЫБОР
	|			КОГДА ДвиженияПоКассеОбороты.ТипДвижения = ЗНАЧЕНИЕ(Перечисление.ТипыДвиженияДенежныхСредств.Поступление)
	|				ТОГДА 1
	|			ИНАЧЕ -1
	|		КОНЕЦ * ДвиженияПоКассеОбороты.СуммаОборот) КАК Сумма,
	|	ДвиженияПоКассеОбороты.Регистратор.СтатьяДДС КАК РегистраторСтатьяДДС
	|ИЗ
	|	РегистрНакопления.ДвиженияПоКассе.Обороты(, , Регистратор, КассоваяСмена = &КассоваяСмена) КАК ДвиженияПоКассеОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	ДвиженияПоКассеОбороты.ТипДвижения,
	|	ДвиженияПоКассеОбороты.КассоваяСмена,
	|	ДвиженияПоКассеОбороты.ХозяйственнаяОперация,
	|	ДвиженияПоКассеОбороты.ТипДенежныхСредств,
	|	ДвиженияПоКассеОбороты.Регистратор.СтатьяДДС
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТипДвижения,
	|	ТипДенежныхСредств,
	|	РегистраторСтатьяДДС
	|ИТОГИ
	|	СУММА(Сумма)
	|ПО
	|	ТипДвижения,
	|	ТипДенежныхСредств,
	|	РегистраторСтатьяДДС";
	Query.Parameters.Insert("КассоваяСмена", Док);
	Query.Parameters.Insert("МестоХранения", Док.МестоХранения);
	Query.Parameters.Insert("ДатаКассовойСмены", Док.Дата);
	
	Header = Template.GetArea("Шапка");
	AreaTabularSection = Template.GetArea("Строка");
	AreaTabularSection1 = Template.GetArea("Строка1");
	AreaTabularSection2 = Template.GetArea("Строка2");
	AreaTabularSectionFooter = Template.GetArea("СтрокаПодвал");
	AreaTabularSectionFooterTotal = Template.GetArea("Подвал"); 
	
	Header.Parameters.Fill(Док);
	
	FieldPhoto = Док.Организация.Логотип.Get();
	Try
		Header.Drawings[0].Picture = New Picture(FieldPhoto);
	Except
	EndTry;
	
	Spreadsheet.Put(Header);
	Total = 0;
	Пакет = Query.ВыполнитьПакет();
	ТипДвижения = Пакет.Получить(1).Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	While ТипДвижения.Следующий() do 
		AreaTabularSection.Параметры.Operation = ТипДвижения.ТипДвижения;
		AreaTabularSection.Параметры.Somme = ТипДвижения.Сумма;
		Total = Total + ТипДвижения.Сумма;
		Spreadsheet.Put(AreaTabularSection);
		ТипДенежныхСредств = ТипДвижения.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ТипДенежныхСредств.Следующий() Цикл 
			AreaTabularSection1.Параметры.Operation = ТипДенежныхСредств.ТипДенежныхСредств;
			AreaTabularSection1.Параметры.Somme = ТипДенежныхСредств.Сумма;
			//TotalSomme = Total + ТипДенежныхСредств.Сумма;
			AreaTabularSection1.Области.Получить(0).ОтступСлева = 1;
			Spreadsheet.Put(AreaTabularSection1);
			РегистраторСтатьяДДС = ТипДенежныхСредств.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока РегистраторСтатьяДДС.Следующий() Цикл 
				AreaTabularSection2.Параметры.Operation = РегистраторСтатьяДДС.РегистраторСтатьяДДС;
				AreaTabularSection2.Параметры.Somme = РегистраторСтатьяДДС.Сумма;
				AreaTabularSection2.Области.Получить(0).ОтступСлева = 2;
				//TotalSomme = Total + РегистраторСтатьяДДС.Сумма;
				Spreadsheet.Put(AreaTabularSection2);
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	ТЗИтоги = Пакет.Получить(0).Выгрузить();
	ТЗИтоги.Свернуть("ТипДенежныхСредств","Сумма");
	Для Каждого СтрИтоги из ТЗИтоги Цикл
		AreaTabularSectionFooter.Parameters.Operation = СтрИтоги.ТипДенежныхСредств;
		AreaTabularSectionFooter.Parameters.Somme = ""+Format(СтрИтоги.Сумма,"ЧДЦ=2; ЧРГ=' '; ЧН=0,00");
		Spreadsheet.Put(AreaTabularSectionFooter);
	КонецЦикла;
	
	//AreaTabularSectionFooterTotal.Parameters.Total = ""+Format(Total,"ЧДЦ=2; ЧРГ=' '; ЧН=0,00");
	AreaTabularSectionFooterTotal.Parameters.Дата = ТекущаяДатаСеанса();
	
	Spreadsheet.Put(AreaTabularSectionFooterTotal);
	Spreadsheet.PutHorizontalPageBreak();
	
	Return Spreadsheet;
	
	//}}
EndFunction
